## Mortalidade Infantil 

##### (Nº de óbitos infantis, segundo o local de residência do falecido / Nº de nascidos vivos, segundo o local de residência da mãe) x 1000

###### - Número de óbitos por mil nascidos vivos

In [58]:
import pandas as pd

In [59]:
cod_ibge = pd.read_csv('C:/Users/Lucas/Documents/Git/Natalia_codes/Taxonomia/autm_2020.csv', dtype='str', sep=';', encoding='ISO-8859-1')
#print(type(cod_ibge))
#print(cod_ibge.dtypes)

In [60]:
cod_ibge['nome_uf']= ' '+ cod_ibge['NM_MUN_2020'] + ' ' + cod_ibge['CD_GCUF']

In [61]:
lista_cod= ['nome_uf', 'CD_GCMUN']
cod_ibge = cod_ibge[lista_cod]

In [62]:
cod_ibge = cod_ibge.rename(columns={'CD_GCMUN':'cod_ibge'})

In [63]:
cod_ibge

                        nome_uf cod_ibge
0      ALTA FLORESTA D'OESTE 11  1100015
1                  ARIQUEMES 11  1100023
2                     CABIXI 11  1100031
3                     CACOAL 11  1100049
4                 CEREJEIRAS 11  1100056
...                         ...      ...
5567              VIANÓPOLIS 52  5222005
5568          VICENTINÓPOLIS 52  5222054
5569                VILA BOA 52  5222203
5570           VILA PROPÍCIO 52  5222302
5571                BRASÍLIA 53  5300108

[5572 rows x 2 columns]

In [64]:
obito_df= pd.read_csv('./dados_brutos/obitos_infantis_2016.csv', dtype='str', sep=';', encoding='ISO-8859-1')
obito_df= obito_df.dropna()

In [65]:
obito_df['nome_mun'] = obito_df['Município'].str.slice(6)
obito_df['cod_uf'] = obito_df['Município'].str.slice(0,2)
obito_df['mun_uf'] = obito_df['nome_mun']+ ' '+ obito_df['cod_uf']

In [66]:
lista_obito= ['mun_uf', 'Óbitos_p/Residênc']
obito_df= obito_df[lista_obito]

In [67]:
obito_df = obito_df.rename(columns={'Óbitos_p/Residênc':'obitos'})

In [68]:
obito_df['mun_uf']= obito_df['mun_uf'].str.upper()

In [69]:
obito_df

                           mun_uf obitos
0        ALTA FLORESTA D'OESTE 11      5
1                 ALTO PARAÍSO 11      6
2                    ARIQUEMES 11     26
3                      BURITIS 11      6
4                       CACOAL 11     17
...                           ...    ...
4154            VICENTINÓPOLIS 52      2
4155                  VILA BOA 52      1
4156   MUNICÍPIO IGNORADO - GO 52      1
4157                  BRASÍLIA 53    447
4158                           TO  36350

[4159 rows x 2 columns]

In [70]:
nasc_df= pd.read_csv('./dados_brutos/nasc_2016.csv', dtype='str', sep=';', encoding='ISO-8859-1')
nasc_df= nasc_df.dropna()

In [71]:
nasc_df['nome_mun'] = nasc_df['Município'].str.slice(6)
nasc_df['cod_uf'] = nasc_df['Município'].str.slice(0,2)
nasc_df['mun_uf'] = nasc_df['nome_mun']+ ' '+ nasc_df['cod_uf']

In [72]:
lista_nasc= ['mun_uf', 'Nascim_p/resid.mãe']
nasc_df= nasc_df[lista_nasc]

In [73]:
nasc_df = nasc_df.rename(columns={'Nascim_p/resid.mãe':'nascimentos'})

In [74]:
nasc_df['mun_uf']= nasc_df['mun_uf'].str.upper()

In [75]:
nasc_df

                           mun_uf nascimentos
0        ALTA FLORESTA D'OESTE 11         326
1      ALTO ALEGRE DOS PARECIS 11         168
2                 ALTO PARAÍSO 11         220
3             ALVORADA D'OESTE 11         166
4                    ARIQUEMES 11        1662
...                           ...         ...
5584                  VILA BOA 52          59
5585             VILA PROPÍCIO 52          48
5586   MUNICÍPIO IGNORADO - GO 52          10
5587                  BRASÍLIA 53       43340
5588                           TO     2857800

[5589 rows x 2 columns]

In [76]:
df= pd.merge(obito_df, nasc_df, left_on='mun_uf', right_on="mun_uf", how='inner')

In [79]:
df

                           mun_uf   obitos  nascimentos
0        ALTA FLORESTA D'OESTE 11      5.0        326.0
1                 ALTO PARAÍSO 11      6.0        220.0
2                    ARIQUEMES 11     26.0       1662.0
3                      BURITIS 11      6.0        624.0
4                       CACOAL 11     17.0       1338.0
...                           ...      ...          ...
4152            VICENTINÓPOLIS 52      2.0        106.0
4153                  VILA BOA 52      1.0         59.0
4154   MUNICÍPIO IGNORADO - GO 52      1.0         10.0
4155                  BRASÍLIA 53    447.0      43340.0
4156                           TO  36350.0    2857800.0

[4157 rows x 3 columns]

In [80]:
df['obitos']= df['obitos'].astype(float)
df['nascimentos']= df['nascimentos'].astype(float)

In [81]:
df['mortalidade_infantil_2016']= df['obitos']/df['nascimentos']

In [82]:
df['mortalidade_infantil_2016']= df['mortalidade_infantil_2016']*1000

In [83]:
df['mortalidade_infantil_2016']= df['mortalidade_infantil_2016'].apply(lambda x: '{:.2f}'.format(x))

In [84]:
df= df.astype(str)
#print(df.dtypes)

In [85]:
#df['mun_uf'][0]

In [86]:
#cod_ibge['nome_uf'][0]

In [87]:
df_all= pd.merge(df, cod_ibge, left_on='mun_uf', right_on='nome_uf', how='inner')

In [88]:
lista_all = ['cod_ibge', 'mortalidade_infantil_2016']
df_all = df_all[lista_all]

In [89]:
df_all

     cod_ibge mortalidade_infantil_2016
0     1100015                     15.34
1     1100403                     27.27
2     1100023                     15.64
3     1100452                      9.62
4     1100049                     12.71
...       ...                       ...
4128  5221908                     52.63
4129  5222005                     12.05
4130  5222054                     18.87
4131  5222203                     16.95
4132  5300108                     10.31

[4133 rows x 2 columns]

In [90]:
df_all.to_json('mortalidade_infantil_2016.json', orient='records')